'''
3. Дана длина ребра куба. Найти объем куба и площадь его боковой
поверхности.
'''

rebro = 10
obem = rebro ** 3
ploschad = rebro ** 2

print(obem, ploschad)
