'''
1. Создать строку равную третьему символу введенной строки.
'''

input_str = input("Enter str ")
str_3 = input_str[2]

print(str_3)