'''
2. Создать строку равную предпоследнему символу введенной строки.
'''

input_str = input("Enter str ")
str_2 = input_str[-2]

print(str_2)