'''
3. Создать строку равную первым пяти символам введенной строки.
'''

input_str = input("Enter str ")
str_5 = input_str[:5]

print(str_5)