'''
Создать строку равную введенной строку без последних двух символов.
'''

input_str = input("Enter str ")
str_2 = input_str[:-2]

print(str_2)