'''
1. Даны 2 действительных числа a и b. Получить их сумму, разность и
произведение.
'''

a = 10
b = 2
summa = a + b
raznost = a - b
proizvedenie = a * b

print(summa, raznost, proizvedenie)
